Autodesk.Revit.DB.DirectContext3D.DrawContext.IsAvailable
Checks whether the facilities of this class are available for use in the current scope.
Remarks:
This class can perform drawing operations and access the state of parameters related to drawing only
in lock-step with rendering inside of Revit. As a consequence, the facilities of this class are not available for
use outside of the scope determined by the callback Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.RenderScene(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DisplayStyle).
Certain methods of other DirectContext3D objects, e.g., VertexBuffer::Map() are similarly restricted by the same scope.
Returns:
True if the DrawContext is available for rendering, false otherwise.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.SetWorldTransform(Autodesk.Revit.DB.Transform)
Sets the world transformation that will be applied to geometry during rendering.
trf:
The transformation matrix.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideTransparency(System.Double@)
Returns override transparency that will be applied to geometry during rendering.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideColor(Autodesk.Revit.DB.Color@)
Returns override color that will be applied to geometry during rendering.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.IsTransparentPass
Determines whether the current rendering pass is for transparent objects.
Remarks:
Opaque and transparent geometry should be submitted for rendering separately.
See Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.UseInTransparentPass(Autodesk.Revit.DB.View).
Returns:
True when the server should be submitting transparent objects for rendering, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetCamera
Gets the camera corresponding to the Revit view where rendering takes place.
Returns:
The camera.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetClipPlanes
Gets the clipping planes for the Revit view where rendering takes place.
Clipping planes control the 3D extent of a view and can be set using Section Box in Revit.
Returns:
The array of clipping planes, which is empty if none are set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetClipRectangle
Gets the clip rectangle for the Revit view where rendering takes place. The clip rectangle
is the area currently being redrawn, which may be smaller than the view rectangle.
Returns:
The clip rectangle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.GetViewRectangle
Gets the rectangle that represents the extent (in 2D) of the Revit view where rendering takes place.
Returns:
The view rectangle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.IsInterrupted
Checks whether the current rendering pass has been interrupted.
Returns:
True if the current rendering pass has been interrupted before its completion, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.FlushBuffer(Autodesk.Revit.DB.DirectContext3D.VertexBuffer,System.Int32,Autodesk.Revit.DB.DirectContext3D.IndexBuffer,System.Int32,Autodesk.Revit.DB.DirectContext3D.VertexFormat,Autodesk.Revit.DB.DirectContext3D.EffectInstance,Autodesk.Revit.DB.DirectContext3D.PrimitiveType,System.Int32,System.Int32)
Submits geometry for rendering.
vertexBuffer:
The vertex buffer that contains vertex data.
vertexCount:
The number of vertices in the vertex buffer.
indexBuffer:
The index buffer that contains indices into the vertex buffer.
indexCount:
The number of indices in the index buffer.
vertexFormat:
The format of the vertices in the vertex buffer.
effectInstance:
The effect instance to be used for drawing this piece of geometry.
primitiveType:
The type of geometry primitive used in the index buffer.
start:
The first index to use for drawing.
primitiveCount:
The number of primitives to draw.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A change in the graphics state has made the vertex buffer vertexBuffer invalid for rendering.
-or-
A change in the graphics state has made the index buffer indexBuffer invalid for rendering.
-or-
A change in the graphics state has made the vertex format vertexFormat invalid for rendering.
-or-
A change in the graphics state has made the effect instance effectInstance invalid for rendering.
-or-
The vertex format vertexFormat and the effect instance effectInstance do not match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext
A class that provides drawing functionality for use by Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer servers
Remarks:
The drawing facility of this class is conceptually similar to a low-level graphics API.
The functionality operates on a set of geometry primitives such as triangles, lines, and points, which are encoded into
a set of vertex and index buffers.
Aside from submission of geometry in buffers, a major part of the drawing process is
responding to certain changes in graphics state. For example, users of this class can implement progressive rendering
of geometry by testing whether there have been interruptions that should prevent the drawing from being completed.
Since:
2017